
// Фабрика для создания объекта клиента
//
// Параметры:
//  ПараметрыКлиента - Структура:
//		* AccessKey		-	Строка	-	(обязательный) Идентификатор ключа
//		* MessageBody	-	Строка	-	(обязательный) Секретный ключ
//		* SecurityToken	-	Строка	-	(опционально) Временный токен доступа
//		* Endpoint		-	Строка	-	(опционально) Адрес сервиса
//		* Version		-	Строка	-	(опционально) Версия используемого протокола
//		* Region		-	Строка	-	(опционально) Регион сервиса 
// 
// Возвращаемое значение:
//  ОбработкаОбъект.ЯндексMQ2 - Экземпляр объекта обработки
//
Функция НовыйКлиент( Знач ПараметрыКлиента ) Экспорт
	
	УстановитьПривилегированныйРежим( Истина );
	
	Объект = Обработки.ЯндексMQ2.Создать();
	
	Если ПараметрыКлиента.Свойство( "AccessKey" ) Тогда
		Объект._AccessKey = ПараметрыКлиента.AccessKey;
	КонецЕсли;
	
	Если ПараметрыКлиента.Свойство( "SecretKey" ) Тогда
		Объект._SecretKey = ПараметрыКлиента.SecretKey;
	КонецЕсли;
	
	Если ПараметрыКлиента.Свойство( "SecurityToken" ) Тогда
		Объект._SecurityToken = ПараметрыКлиента.SecurityToken;
	КонецЕсли;
	
	Если ПараметрыКлиента.Свойство( "Endpoint" ) Тогда
		Объект._Endpoint = ПараметрыКлиента.Endpoint;
	КонецЕсли;
	
	Если ПараметрыКлиента.Свойство( "Version" ) Тогда
		Объект._Version = ПараметрыКлиента.Version;
	КонецЕсли;
	
	Если ПараметрыКлиента.Свойство( "Region" ) Тогда
		Объект._Region = ПараметрыКлиента.Region;
	КонецЕсли;

	Возврат Объект;
	
КонецФункции

