
&НаКлиенте
Процедура ListQueues(Команда)
	ListQueuesНаСервере();
КонецПроцедуры

&НаСервере
Процедура ListQueuesНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	Результат = Об.ListQueues();
	
	_ТекстОтвета = КоннекторHTTP.КакТекст( Результат );
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура SendMessage(Команда)
	
	Ожидание = ВвестиСтрокуАсинх("","Адрес очереди",0);
	АдресОчереди = Ждать Ожидание;
	Если Неопределено = АдресОчереди Тогда
		Возврат;
	КонецЕсли;
	
	Ожидание = ВвестиСтрокуАсинх("", "Сообщение",0, Истина);
	Сообщение = Ждать Ожидание;
	Если Неопределено = Сообщение Тогда
		Возврат;
	КонецЕсли;
	
	SendMessageСерв(АдресОчереди, Сообщение);
	
КонецПроцедуры


&НаСервере
Процедура SendMessageСерв(АдресОчереди, Сообщение)

	Об = РеквизитФормыВЗначение("Объект");
	
	Попытка
		Результат = Об.SendMessage(АдресОчереди, Сообщение);
	Исключение
		_ТекстОтвета = ОписаниеОшибки();
		Возврат;
	КонецПопытки;

	_ТекстОтвета = КоннекторHTTP.КакТекст( Результат );
		
КонецПроцедуры


&НаСервере
Процедура RecieveMessageНаСервере(Знач АдресОчереди)
	
	Об = РеквизитФормыВЗначение("Объект");
	
	Попытка
		Результат = Об.RecieveMessage(АдресОчереди);
	Исключение
		_ТекстОтвета = ОписаниеОшибки();
		Возврат;
	КонецПопытки;
	
	_ТекстОтвета = КоннекторHTTP.КакТекст( Результат );
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура RecieveMessage(Команда)
	
	Ожидание = ВвестиСтрокуАсинх("", "Адрес очереди",0);
	АдресОчереди = Ждать Ожидание;
	Если Неопределено = АдресОчереди Тогда
		Возврат;
	КонецЕсли;
	
	RecieveMessageНаСервере(АдресОчереди);
	
КонецПроцедуры


&НаСервере
Процедура DeleteMessageНаСервере( АдресОчереди, ИдентификаторСообщения )
	
	Об = РеквизитФормыВЗначение("Объект");
	
	Попытка
		Результат = Об.DeleteMessage(АдресОчереди, ИдентификаторСообщения);
	Исключение
		_ТекстОтвета = ОписаниеОшибки();
		Возврат;
	КонецПопытки;

	_ТекстОтвета = КоннекторHTTP.КакТекст( Результат );
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура DeleteMessage(Команда)
	
	Ожидание = ВвестиСтрокуАсинх("", "Адрес очереди",0);
	АдресОчереди = Ждать Ожидание;
	Если Неопределено = АдресОчереди Тогда
		Возврат;
	КонецЕсли;
	
	Ожидание = ВвестиСтрокуАсинх("", "Идентификатор сообщения",0, Истина);
	ИдентификаторСообщения = Ждать Ожидание;
	Если Неопределено = ИдентификаторСообщения Тогда
		Возврат;
	КонецЕсли;
	
	DeleteMessageНаСервере(АдресОчереди, ИдентификаторСообщения );
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура CreateQueue(Команда)
	
	Ожидание = ВвестиСтрокуАсинх("", "Имя создаваемой очереди", 0, Ложь);
	ИмяОчереди = Ждать Ожидание;
	Если ЗначениеЗаполнено(ИмяОчереди) Тогда
		CreateQueueНаСервере( ИмяОчереди );
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура CreateQueueНаСервере( Знач ИмяОчереди )
	
	Об = РеквизитФормыВЗначение("Объект");
	Результат = Об.CreateQueue(ИмяОчереди);
	
	_ТекстОтвета = КоннекторHTTP.КакТекст( Результат );
	
КонецПроцедуры


&НаСервере
Процедура DeleteQueueНаСервере( Знач АдресОчереди )
	
	Об = РеквизитФормыВЗначение("Объект");
	Результат = Об.DeleteQueue( АдресОчереди );
	
	_ТекстОтвета = КоннекторHTTP.КакТекст( Результат );

КонецПроцедуры


&НаКлиенте
Асинх Процедура DeleteQueue(Команда)
	
	Ожидание = ВвестиСтрокуАсинх("", "Адрес очереди для удаления", 0, Ложь);
	АдресОчереди = Ждать Ожидание;
	Если ЗначениеЗаполнено(АдресОчереди) Тогда
		DeleteQueueНаСервере( АдресОчереди );
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура PurgeQueueНаСервере( Знач АдресОчереди )
	
	Об = РеквизитФормыВЗначение("Объект");
	Результат = Об.PurgeQueue( АдресОчереди );
	
	_ТекстОтвета = КоннекторHTTP.КакТекст( Результат );
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура PurgeQueue(Команда)
	
	Ожидание = ВвестиСтрокуАсинх("", "Адрес очереди для очистки", 0, Ложь);
	АдресОчереди = Ждать Ожидание;
	Если ЗначениеЗаполнено(АдресОчереди) Тогда
		PurgeQueueНаСервере( АдресОчереди );
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура GetQueueUrlНаСервере( Знач ИмяОчереди )
	
	Об = РеквизитФормыВЗначение("Объект");
	Результат = Об.GetQueueUrl( ИмяОчереди );
	
	_ТекстОтвета = КоннекторHTTP.КакТекст( Результат );

КонецПроцедуры


&НаКлиенте
Асинх Процедура GetQueueUrl(Команда)
	
	Ожидание = ВвестиСтрокуАсинх("", "Имя очереди", 0, Ложь);
	ИмяОчереди = Ждать Ожидание;
	Если ЗначениеЗаполнено(ИмяОчереди) Тогда
		GetQueueUrlНаСервере( ИмяОчереди );
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура GetQueueAttributesНаСервере( Знач АдресОчереди )
	
	Об = РеквизитФормыВЗначение("Объект");
	Результат = Об.GetQueueAttributesAll( АдресОчереди );
	
	_ТекстОтвета = КоннекторHTTP.КакТекст( Результат );
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура GetQueueAttributes(Команда)
	
	Ожидание = ВвестиСтрокуАсинх("", "Адрес очереди", 0, Ложь);
	АдресОчереди = Ждать Ожидание;
	Если ЗначениеЗаполнено(АдресОчереди) Тогда
		GetQueueAttributesНаСервере( АдресОчереди );
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура SetQueueAttributesНаСервере(Знач АдресОчереди)
	
	Об = РеквизитФормыВЗначение("Объект");
	Результат = Об.SetQueueAttributes( АдресОчереди, Новый Структура("DelaySeconds, MaximumMessageSize", 0, 262144 ) );
	
	_ТекстОтвета = КоннекторHTTP.КакТекст( Результат );
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура SetQueueAttributes(Команда)
	
	Ожидание = ВвестиСтрокуАсинх("", "Адрес очереди", 0, Ложь);
	АдресОчереди = Ждать Ожидание;
	Если ЗначениеЗаполнено(АдресОчереди) Тогда
		SetQueueAttributesНаСервере( АдресОчереди );
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ChangeMessageVisibilityНаСервере( Знач АдресОчереди, Знач ИдСообщения, Знач ОжидатьСекунд )
	
	Об = РеквизитФормыВЗначение("Объект");
	Результат = Об.ChangeMessageVisibility( АдресОчереди, ИдСообщения, ОжидатьСекунд );
	
	_ТекстОтвета = КоннекторHTTP.КакТекст( Результат );
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура ChangeMessageVisibility(Команда)
	Ожидание = ВвестиСтрокуАсинх( "", "Адрес очереди", 0, Ложь );
	АдресОчереди = Ждать Ожидание;
	Если НЕ ЗначениеЗаполнено( АдресОчереди ) Тогда
		Возврат;
	КонецЕсли;
	
	Ожидание = ВвестиСтрокуАсинх( "", "Идентификатор сообщения", 0, Ложь );
	ИдСообщения = Ждать Ожидание;
	Если НЕ ЗначениеЗаполнено( ИдСообщения ) Тогда
		Возврат;
	КонецЕсли;
	
	Ожидание = ВвестиСтрокуАсинх( 0, "Идентификатор сообщения", 0, Ложь );
	ОжидатьСекунд = Ждать Ожидание;
	Если НЕ ЗначениеЗаполнено( ОжидатьСекунд ) Тогда
		Возврат;
	КонецЕсли;
	
	ChangeMessageVisibilityНаСервере( АдресОчереди, ИдСообщения, ОжидатьСекунд );
	
КонецПроцедуры

